{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "Convolution1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution1", 0, 0, {}]]], "name": "BatchNorm1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU1"}, "inbound_nodes": [[["BatchNorm1", 0, 0, {}]]], "name": "ReLU1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["ReLU1", 0, 0, {}]]], "name": "Convolution2"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["Convolution2", 0, 0, {}]]], "name": "ConvolutionDepthwise1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise1", 0, 0, {}]]], "name": "BatchNorm2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU2"}, "inbound_nodes": [[["BatchNorm2", 0, 0, {}]]], "name": "ReLU2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["ReLU2", 0, 0, {}]]], "name": "Convolution3"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["Convolution3", 0, 0, {}]]], "name": "ConvolutionDepthwise2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise2", 0, 0, {}]]], "name": "BatchNorm3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU3"}, "inbound_nodes": [[["BatchNorm3", 0, 0, {}]]], "name": "ReLU3"}, {"class_name": "MaxPooling2D", "config": {"name": "Pooling1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["ReLU3", 0, 0, {}]]], "name": "Pooling1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Pooling1", 0, 0, {}]]], "name": "Convolution4"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm4", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution4", 0, 0, {}]]], "name": "BatchNorm4"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm4", 0, 0, {}]]], "name": "ConvolutionDepthwise3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm5", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise3", 0, 0, {}]]], "name": "BatchNorm5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU4"}, "inbound_nodes": [[["BatchNorm5", 0, 0, {}]]], "name": "ReLU4"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "Concat1", "axis": -1}, "inbound_nodes": [[["Pooling1", 0, 0, {}], ["ReLU4", 0, 0, {}]]], "name": "Concat1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution5", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Concat1", 0, 0, {}]]], "name": "Convolution5"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm6", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution5", 0, 0, {}]]], "name": "BatchNorm6"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm6", 0, 0, {}]]], "name": "ConvolutionDepthwise4"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm7", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise4", 0, 0, {}]]], "name": "BatchNorm7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU5"}, "inbound_nodes": [[["BatchNorm7", 0, 0, {}]]], "name": "ReLU5"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "Concat2", "axis": -1}, "inbound_nodes": [[["Concat1", 0, 0, {}], ["ReLU5", 0, 0, {}]]], "name": "Concat2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution6", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Concat2", 0, 0, {}]]], "name": "Convolution6"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm8", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution6", 0, 0, {}]]], "name": "BatchNorm8"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise5", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm8", 0, 0, {}]]], "name": "ConvolutionDepthwise5"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm9", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise5", 0, 0, {}]]], "name": "BatchNorm9"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU6"}, "inbound_nodes": [[["BatchNorm9", 0, 0, {}]]], "name": "ReLU6"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "Concat3", "axis": -1}, "inbound_nodes": [[["Concat2", 0, 0, {}], ["ReLU6", 0, 0, {}]]], "name": "Concat3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution7", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Concat3", 0, 0, {}]]], "name": "Convolution7"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm10", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution7", 0, 0, {}]]], "name": "BatchNorm10"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise6", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm10", 0, 0, {}]]], "name": "ConvolutionDepthwise6"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm11", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise6", 0, 0, {}]]], "name": "BatchNorm11"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU7"}, "inbound_nodes": [[["BatchNorm11", 0, 0, {}]]], "name": "ReLU7"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "Concat4", "axis": -1}, "inbound_nodes": [[["Concat3", 0, 0, {}], ["ReLU7", 0, 0, {}]]], "name": "Concat4"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution8", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Concat4", 0, 0, {}]]], "name": "Convolution8"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm12", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution8", 0, 0, {}]]], "name": "BatchNorm12"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU8"}, "inbound_nodes": [[["BatchNorm12", 0, 0, {}]]], "name": "ReLU8"}, {"class_name": "MaxPooling2D", "config": {"name": "Pooling2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["ReLU8", 0, 0, {}]]], "name": "Pooling2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution9", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Pooling2", 0, 0, {}]]], "name": "Convolution9"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm13", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution9", 0, 0, {}]]], "name": "BatchNorm13"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise7", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm13", 0, 0, {}]]], "name": "ConvolutionDepthwise7"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm14", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise7", 0, 0, {}]]], "name": "BatchNorm14"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU9"}, "inbound_nodes": [[["BatchNorm14", 0, 0, {}]]], "name": "ReLU9"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "Concat5", "axis": -1}, "inbound_nodes": [[["Pooling2", 0, 0, {}], ["ReLU9", 0, 0, {}]]], "name": "Concat5"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution10", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Concat5", 0, 0, {}]]], "name": "Convolution10"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm15", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution10", 0, 0, {}]]], "name": "BatchNorm15"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise8", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm15", 0, 0, {}]]], "name": "ConvolutionDepthwise8"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm16", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise8", 0, 0, {}]]], "name": "BatchNorm16"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU10"}, "inbound_nodes": [[["BatchNorm16", 0, 0, {}]]], "name": "ReLU10"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "Concat6", "axis": -1}, "inbound_nodes": [[["Concat5", 0, 0, {}], ["ReLU10", 0, 0, {}]]], "name": "Concat6"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution11", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Concat6", 0, 0, {}]]], "name": "Convolution11"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm17", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution11", 0, 0, {}]]], "name": "BatchNorm17"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise9", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm17", 0, 0, {}]]], "name": "ConvolutionDepthwise9"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm18", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise9", 0, 0, {}]]], "name": "BatchNorm18"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU11"}, "inbound_nodes": [[["BatchNorm18", 0, 0, {}]]], "name": "ReLU11"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "Concat7", "axis": -1}, "inbound_nodes": [[["Concat6", 0, 0, {}], ["ReLU11", 0, 0, {}]]], "name": "Concat7"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution12", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Concat7", 0, 0, {}]]], "name": "Convolution12"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm19", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution12", 0, 0, {}]]], "name": "BatchNorm19"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise10", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm19", 0, 0, {}]]], "name": "ConvolutionDepthwise10"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm20", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise10", 0, 0, {}]]], "name": "BatchNorm20"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU12"}, "inbound_nodes": [[["BatchNorm20", 0, 0, {}]]], "name": "ReLU12"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "Concat8", "axis": -1}, "inbound_nodes": [[["Concat7", 0, 0, {}], ["ReLU12", 0, 0, {}]]], "name": "Concat8"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution13", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Concat8", 0, 0, {}]]], "name": "Convolution13"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm21", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution13", 0, 0, {}]]], "name": "BatchNorm21"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise11", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm21", 0, 0, {}]]], "name": "ConvolutionDepthwise11"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm22", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise11", 0, 0, {}]]], "name": "BatchNorm22"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU13"}, "inbound_nodes": [[["BatchNorm22", 0, 0, {}]]], "name": "ReLU13"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "Concat9", "axis": -1}, "inbound_nodes": [[["Concat8", 0, 0, {}], ["ReLU13", 0, 0, {}]]], "name": "Concat9"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution14", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Concat9", 0, 0, {}]]], "name": "Convolution14"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm23", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution14", 0, 0, {}]]], "name": "BatchNorm23"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise12", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm23", 0, 0, {}]]], "name": "ConvolutionDepthwise12"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm24", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise12", 0, 0, {}]]], "name": "BatchNorm24"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU14"}, "inbound_nodes": [[["BatchNorm24", 0, 0, {}]]], "name": "ReLU14"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "Concat10", "axis": -1}, "inbound_nodes": [[["Concat9", 0, 0, {}], ["ReLU14", 0, 0, {}]]], "name": "Concat10"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution15", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Concat10", 0, 0, {}]]], "name": "Convolution15"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm25", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution15", 0, 0, {}]]], "name": "BatchNorm25"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "First"}, "inbound_nodes": [[["BatchNorm25", 0, 0, {}]]], "name": "First"}, {"class_name": "MaxPooling2D", "config": {"name": "Pooling4", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["First", 0, 0, {}]]], "name": "Pooling4"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution17", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Pooling4", 0, 0, {}]]], "name": "Convolution17"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm27", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution17", 0, 0, {}]]], "name": "BatchNorm27"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise13", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm27", 0, 0, {}]]], "name": "ConvolutionDepthwise13"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm28", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise13", 0, 0, {}]]], "name": "BatchNorm28"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU16"}, "inbound_nodes": [[["BatchNorm28", 0, 0, {}]]], "name": "ReLU16"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "Concat11", "axis": -1}, "inbound_nodes": [[["Pooling4", 0, 0, {}], ["ReLU16", 0, 0, {}]]], "name": "Concat11"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution18", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Concat11", 0, 0, {}]]], "name": "Convolution18"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm29", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution18", 0, 0, {}]]], "name": "BatchNorm29"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise14", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm29", 0, 0, {}]]], "name": "ConvolutionDepthwise14"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm30", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise14", 0, 0, {}]]], "name": "BatchNorm30"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU17"}, "inbound_nodes": [[["BatchNorm30", 0, 0, {}]]], "name": "ReLU17"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "Concat12", "axis": -1}, "inbound_nodes": [[["Concat11", 0, 0, {}], ["ReLU17", 0, 0, {}]]], "name": "Concat12"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution19", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Concat12", 0, 0, {}]]], "name": "Convolution19"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm31", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution19", 0, 0, {}]]], "name": "BatchNorm31"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise15", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm31", 0, 0, {}]]], "name": "ConvolutionDepthwise15"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm32", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ConvolutionDepthwise15", 0, 0, {}]]], "name": "BatchNorm32"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ReLU18"}, "inbound_nodes": [[["BatchNorm32", 0, 0, {}]]], "name": "ReLU18"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "Concat13", "axis": -1}, "inbound_nodes": [[["Concat12", 0, 0, {}], ["ReLU18", 0, 0, {}]]], "name": "Concat13"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Convolution20", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["Concat13", 0, 0, {}]]], "name": "Convolution20"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "BatchNorm33", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Convolution20", 0, 0, {}]]], "name": "BatchNorm33"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "ConvolutionDepthwise16", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["BatchNorm33", 