{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "Convolution1", "class_name": "Conv2D", "config": {"name": "Convolution1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "BatchNorm1", "class_name": "BatchNormalization", "config": {"name": "BatchNorm1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution1", 0, 0, {}]]]}, {"name": "ReLU1", "class_name": "Activation", "config": {"name": "ReLU1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm1", 0, 0, {}]]]}, {"name": "Convolution2", "class_name": "Conv2D", "config": {"name": "Convolution2", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ReLU1", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise1", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise1", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Convolution2", 0, 0, {}]]]}, {"name": "BatchNorm2", "class_name": "BatchNormalization", "config": {"name": "BatchNorm2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise1", 0, 0, {}]]]}, {"name": "ReLU2", "class_name": "Activation", "config": {"name": "ReLU2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm2", 0, 0, {}]]]}, {"name": "Convolution3", "class_name": "Conv2D", "config": {"name": "Convolution3", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ReLU2", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise2", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise2", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Convolution3", 0, 0, {}]]]}, {"name": "BatchNorm3", "class_name": "BatchNormalization", "config": {"name": "BatchNorm3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise2", 0, 0, {}]]]}, {"name": "ReLU3", "class_name": "Activation", "config": {"name": "ReLU3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm3", 0, 0, {}]]]}, {"name": "Pooling1", "class_name": "MaxPooling2D", "config": {"name": "Pooling1", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["ReLU3", 0, 0, {}]]]}, {"name": "Convolution4", "class_name": "Conv2D", "config": {"name": "Convolution4", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Pooling1", 0, 0, {}]]]}, {"name": "BatchNorm4", "class_name": "BatchNormalization", "config": {"name": "BatchNorm4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution4", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise3", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise3", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["BatchNorm4", 0, 0, {}]]]}, {"name": "BatchNorm5", "class_name": "BatchNormalization", "config": {"name": "BatchNorm5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise3", 0, 0, {}]]]}, {"name": "ReLU4", "class_name": "Activation", "config": {"name": "ReLU4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm5", 0, 0, {}]]]}, {"name": "Concat1", "class_name": "Concatenate", "config": {"name": "Concat1", "trainable": true, "axis": -1}, "inbound_nodes": [[["Pooling1", 0, 0, {}], ["ReLU4", 0, 0, {}]]]}, {"name": "Convolution5", "class_name": "Conv2D", "config": {"name": "Convolution5", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat1", 0, 0, {}]]]}, {"name": "BatchNorm6", "class_name": "BatchNormalization", "config": {"name": "BatchNorm6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution5", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise4", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise4", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["BatchNorm6", 0, 0, {}]]]}, {"name": "BatchNorm7", "class_name": "BatchNormalization", "config": {"name": "BatchNorm7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise4", 0, 0, {}]]]}, {"name": "ReLU5", "class_name": "Activation", "config": {"name": "ReLU5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm7", 0, 0, {}]]]}, {"name": "Concat2", "class_name": "Concatenate", "config": {"name": "Concat2", "trainable": true, "axis": -1}, "inbound_nodes": [[["Concat1", 0, 0, {}], ["ReLU5", 0, 0, {}]]]}, {"name": "Convolution6", "class_name": "Conv2D", "config": {"name": "Convolution6", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat2", 0, 0, {}]]]}, {"name": "BatchNorm8", "class_name": "BatchNormalization", "config": {"name": "BatchNorm8", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution6", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise5", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise5", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["BatchNorm8", 0, 0, {}]]]}, {"name": "BatchNorm9", "class_name": "BatchNormalization", "config": {"name": "BatchNorm9", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise5", 0, 0, {}]]]}, {"name": "ReLU6", "class_name": "Activation", "config": {"name": "ReLU6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm9", 0, 0, {}]]]}, {"name": "Concat3", "class_name": "Concatenate", "config": {"name": "Concat3", "trainable": true, "axis": -1}, "inbound_nodes": [[["Concat2", 0, 0, {}], ["ReLU6", 0, 0, {}]]]}, {"name": "Convolution7", "class_name": "Conv2D", "config": {"name": "Convolution7", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat3", 0, 0, {}]]]}, {"name": "BatchNorm10", "class_name": "BatchNormalization", "config": {"name": "BatchNorm10", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution7", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise6", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise6", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["BatchNorm10", 0, 0, {}]]]}, {"name": "BatchNorm11", "class_name": "BatchNormalization", "config": {"name": "BatchNorm11", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise6", 0, 0, {}]]]}, {"name": "ReLU7", "class_name": "Activation", "config": {"name": "ReLU7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm11", 0, 0, {}]]]}, {"name": "Concat4", "class_name": "Concatenate", "config": {"name": "Concat4", "trainable": true, "axis": -1}, "inbound_nodes": [[["Concat3", 0, 0, {}], ["ReLU7", 0, 0, {}]]]}, {"name": "Convolution8", "class_name": "Conv2D", "config": {"name": "Convolution8", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat4", 0, 0, {}]]]}, {"name": "BatchNorm12", "class_name": "BatchNormalization", "config": {"name": "BatchNorm12", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution8", 0, 0, {}]]]}, {"name": "ReLU8", "class_name": "Activation", "config": {"name": "ReLU8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm12", 0, 0, {}]]]}, {"name": "Pooling2", "class_name": "MaxPooling2D", "config": {"name": "Pooling2", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["ReLU8", 0, 0, {}]]]}, {"name": "Convolution9", "class_name": "Conv2D", "config": {"name": "Convolution9", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Pooling2", 0, 0, {}]]]}, {"name": "BatchNorm13", "class_name": "BatchNormalization", "config": {"name": "BatchNorm13", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution9", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise7", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise7", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["BatchNorm13", 0, 0, {}]]]}, {"name": "BatchNorm14", "class_name": "BatchNormalization", "config": {"name": "BatchNorm14", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise7", 0, 0, {}]]]}, {"name": "ReLU9", "class_name": "Activation", "config": {"name": "ReLU9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm14", 0, 0, {}]]]}, {"name": "Concat5", "class_name": "Concatenate", "config": {"name": "Concat5", "trainable": true, "axis": -1}, "inbound_nodes": [[["Pooling2", 0, 0, {}], ["ReLU9", 0, 0, {}]]]}, {"name": "Convolution10", "class_name": "Conv2D", "config": {"name": "Convolution10", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat5", 0, 0, {}]]]}, {"name": "BatchNorm15", "class_name": "BatchNormalization", "config": {"name": "BatchNorm15", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution10", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise8", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise8", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["BatchNorm15", 0, 0, {}]]]}, {"name": "BatchNorm16", "class_name": "BatchNormalization", "config": {"name": "BatchNorm16", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise8", 0, 0, {}]]]}, {"name": "ReLU10", "class_name": "Activation", "config": {"name": "ReLU10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm16", 0, 0, {}]]]}, {"name": "Concat6", "class_name": "Concatenate", "config": {"name": "Concat6", "trainable": true, "axis": -1}, "inbound_nodes": [[["Concat5", 0, 0, {}], ["ReLU10", 0, 0, {}]]]}, {"name": "Convolution11", "class_name": "Conv2D", "config": {"name": "Convolution11", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat6", 0, 0, {}]]]}, {"name": "BatchNorm17", "class_name": "BatchNormalization", "config": {"name": "BatchNorm17", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution11", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise9", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise9", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["BatchNorm17", 0, 0, {}]]]}, {"name": "BatchNorm18", "class_name": "BatchNormalization", "config": {"name": "BatchNorm18", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise9", 0, 0, {}]]]}, {"name": "ReLU11", "class_name": "Activation", "config": {"name": "ReLU11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm18", 0, 0, {}]]]}, {"name": "Concat7", "class_name": "Concatenate", "config": {"name": "Concat7", "trainable": true, "axis": -1}, "inbound_nodes": [[["Concat6", 0, 0, {}], ["ReLU11", 0, 0, {}]]]}, {"name": "Convolution12", "class_name": "Conv2D", "config": {"name": "Convolution12", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat7", 0, 0, {}]]]}, {"name": "BatchNorm19", "class_name": "BatchNormalization", "config": {"name": "BatchNorm19", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution12", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise10", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise10", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["BatchNorm19", 0, 0, {}]]]}, {"name": "BatchNorm20", "class_name": "BatchNormalization", "config": {"name": "BatchNorm20", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise10", 0, 0, {}]]]}, {"name": "ReLU12", "class_name": "Activation", "config": {"name": "ReLU12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm20", 0, 0, {}]]]}, {"name": "Concat8", "class_name": "Concatenate", "config": {"name": "Concat8", "trainable": true, "axis": -1}, "inbound_nodes": [[["Concat7", 0, 0, {}], ["ReLU12", 0, 0, {}]]]}, {"name": "Convolution13", "class_name": "Conv2D", "config": {"name": "Convolution13", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat8", 0, 0, {}]]]}, {"name": "BatchNorm21", "class_name": "BatchNormalization", "config": {"name": "BatchNorm21", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution13", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise11", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise11", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["BatchNorm21", 0, 0, {}]]]}, {"name": "BatchNorm22", "class_name": "BatchNormalization", "config": {"name": "BatchNorm22", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise11", 0, 0, {}]]]}, {"name": "ReLU13", "class_name": "Activation", "config": {"name": "ReLU13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm22", 0, 0, {}]]]}, {"name": "Concat9", "class_name": "Concatenate", "config": {"name": "Concat9", "trainable": true, "axis": -1}, "inbound_nodes": [[["Concat8", 0, 0, {}], ["ReLU13", 0, 0, {}]]]}, {"name": "Convolution14", "class_name": "Conv2D", "config": {"name": "Convolution14", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat9", 0, 0, {}]]]}, {"name": "BatchNorm23", "class_name": "BatchNormalization", "config": {"name": "BatchNorm23", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution14", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise12", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise12", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["BatchNorm23", 0, 0, {}]]]}, {"name": "BatchNorm24", "class_name": "BatchNormalization", "config": {"name": "BatchNorm24", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise12", 0, 0, {}]]]}, {"name": "ReLU14", "class_name": "Activation", "config": {"name": "ReLU14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm24", 0, 0, {}]]]}, {"name": "Concat10", "class_name": "Concatenate", "config": {"name": "Concat10", "trainable": true, "axis": -1}, "inbound_nodes": [[["Concat9", 0, 0, {}], ["ReLU14", 0, 0, {}]]]}, {"name": "Convolution15", "class_name": "Conv2D", "config": {"name": "Convolution15", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat10", 0, 0, {}]]]}, {"name": "BatchNorm25", "class_name": "BatchNormalization", "config": {"name": "BatchNorm25", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution15", 0, 0, {}]]]}, {"name": "First", "class_name": "Activation", "config": {"name": "First", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm25", 0, 0, {}]]]}, {"name": "Pooling4", "class_name": "MaxPooling2D", "config": {"name": "Pooling4", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["First", 0, 0, {}]]]}, {"name": "Convolution17", "class_name": "Conv2D", "config": {"name": "Convolution17", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Pooling4", 0, 0, {}]]]}, {"name": "BatchNorm27", "class_name": "BatchNormalization", "config": {"name": "BatchNorm27", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution17", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise13", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise13", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["BatchNorm27", 0, 0, {}]]]}, {"name": "BatchNorm28", "class_name": "BatchNormalization", "config": {"name": "BatchNorm28", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise13", 0, 0, {}]]]}, {"name": "ReLU16", "class_name": "Activation", "config": {"name": "ReLU16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm28", 0, 0, {}]]]}, {"name": "Concat11", "class_name": "Concatenate", "config": {"name": "Concat11", "trainable": true, "axis": -1}, "inbound_nodes": [[["Pooling4", 0, 0, {}], ["ReLU16", 0, 0, {}]]]}, {"name": "Convolution18", "class_name": "Conv2D", "config": {"name": "Convolution18", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat11", 0, 0, {}]]]}, {"name": "BatchNorm29", "class_name": "BatchNormalization", "config": {"name": "BatchNorm29", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution18", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise14", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise14", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["BatchNorm29", 0, 0, {}]]]}, {"name": "BatchNorm30", "class_name": "BatchNormalization", "config": {"name": "BatchNorm30", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise14", 0, 0, {}]]]}, {"name": "ReLU17", "class_name": "Activation", "config": {"name": "ReLU17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm30", 0, 0, {}]]]}, {"name": "Concat12", "class_name": "Concatenate", "config": {"name": "Concat12", "trainable": true, "axis": -1}, "inbound_nodes": [[["Concat11", 0, 0, {}], ["ReLU17", 0, 0, {}]]]}, {"name": "Convolution19", "class_name": "Conv2D", "config": {"name": "Convolution19", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat12", 0, 0, {}]]]}, {"name": "BatchNorm31", "class_name": "BatchNormalization", "config": {"name": "BatchNorm31", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution19", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise15", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise15", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["BatchNorm31", 0, 0, {}]]]}, {"name": "BatchNorm32", "class_name": "BatchNormalization", "config": {"name": "BatchNorm32", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ConvolutionDepthwise15", 0, 0, {}]]]}, {"name": "ReLU18", "class_name": "Activation", "config": {"name": "ReLU18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNorm32", 0, 0, {}]]]}, {"name": "Concat13", "class_name": "Concatenate", "config": {"name": "Concat13", "trainable": true, "axis": -1}, "inbound_nodes": [[["Concat12", 0, 0, {}], ["ReLU18", 0, 0, {}]]]}, {"name": "Convolution20", "class_name": "Conv2D", "config": {"name": "Convolution20", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat13", 0, 0, {}]]]}, {"name": "BatchNorm33", "class_name": "BatchNormalization", "config": {"name": "BatchNorm33", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution20", 0, 0, {}]]]}, {"name": "ConvolutionDepthwise16", "class_name": "DepthwiseConv2D", "config": {"name": "ConvolutionDepthwise16", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Constant", "config": {"value": 0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, 